//==========================================================================================================
// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
//==========================================================================================================
int ReadData(string line)
{
    // Выводим сообщение;
    Console.WriteLine(line);
    // Считываем число;
    int number = int.Parse(Console.ReadLine() ?? "0");
    // Возвращаем значение;
    return number;
}

void PrintData(int number) // вывод результата подсчёта;
{
    Console.WriteLine("Количество введённых чисел больше 0: " + number);
}

int CountNum(int M) // подсчёт кол-ва чисел > 0;
{
    int res = 0;
    for (int i = 0; i < M; i++)
    {
        int num = ReadData("Введите число: ");
        if (num > 0) res++;
    }
    return res;
}
int M = ReadData("Введите M количество чисел: ");
PrintData(CountNum(M));